tomyqg/STM32_RTT_F107/components/DeviceDrivers/usart5.c
}


int WIFI_QueryStatus(eSocketType Type)
{
	char send[50] = {'\0'};
	char recv[255] = { '\0' };
	int i = 0,j = 0;
	clear_WIFI();
	rt_mutex_take(wifi_uart_lock, RT_WAITING_FOREVER);
	send[0]= 0x65;
	if(Type == SOCKET_B)
		send[1]= 0x62;
	else if(Type == SOCKET_C)
		send[1]= 0x63;
	else
		return -1;
	
	send[2]= 0x06;
	send[3]= 0x03;
	send[4]= 0x00;
	send[5]= 0x04;

	for(i = 0;i<2;i++)
	{
		clear_WIFI();
		WIFI_SendData(send, 6);
		for(j = 0;j <300;j++)
		{
				if(Cur >= 6)
				{
					memcpy(recv,USART_RX_BUF,6);
					if((recv[0] == 0x65)&&
					(recv[1] == send[1])&&
					(recv[2] == 0x06))
					{
						//查询SOCKET 成功
						printf("WIFI_QueryStatus Successful\n");
						if(recv[4] == 0x01)	//在线
						{
							rt_mutex_release(wifi_uart_lock);
							clear_WIFI();
							return 1;
						}else if(recv[4] == 0x00)	//离线
						{
							rt_mutex_release(wifi_uart_lock);
							clear_WIFI();
							return 0;
						}else	//未知
						{
							rt_mutex_release(wifi_uart_lock);
							clear_WIFI();
							return -1;
						}
					}else
					{
						//创建SOCKET 失败
						printmsg(ECU_DBG_WIFI,"WIFI_QueryStatus Failed");
						rt_mutex_release(wifi_uart_lock);
						clear_WIFI();
						return -1;
					}
					
				}
				delayMS(10);
		}
		printmsg(ECU_DBG_WIFI,"WIFI_CreateSocket WIFI Get reply time out 1");
	}	
	rt_mutex_release(wifi_uart_lock);
	clear_WIFI();
	return -1;
}

//SOCKET A 发送数据  \n需要在传入字符串中带入
int SendToSocketA(char *data ,int length,unsigned char ID[8])
{
	char *sendbuff = NULL;
	sendbuff = malloc(4096);
	sprintf(sendbuff,"a%c%c%c%c%c%c%c%c",ID[0],ID[1],ID[2],ID[3],ID[4],ID[5],ID[6],ID[7]);
	memcpy(&sendbuff[9],data,length);
	clear_WIFI();
	WIFI_SendData(sendbuff, (length+9));
	
	free(sendbuff);
	sendbuff = NULL;
	return 0;
}

//SOCKET B 发送数据
int SendToSocketB(char *data ,int length)
{
	char *sendbuff = NULL;
	if((1 == WIFI_QueryStatus(SOCKET_B)) || (0 == WIFI_Create(SOCKET_B)))
	{
		writeconnecttime();
		sendbuff = malloc(4096);
		sprintf(sendbuff,"b00000000");
		memcpy(&sendbuff[9],data,length);
		
		clear_WIFI();
		WIFI_SendData(sendbuff, (length+9));

		free(sendbuff);
		sendbuff = NULL;
		return 0;
	}
	return -1;
}

//SOCKET C 发送数据
int SendToSocketC(char *data ,int length)
{
	char *sendbuff = NULL;
	char msg_length[6] = {'\0'};
	if((1 == WIFI_QueryStatus(SOCKET_C)) || (0 == WIFI_Create(SOCKET_C)))
	{
		sendbuff = malloc(4096);

		if(data[strlen(data)-1] == '\n'){
			sprintf(msg_length, "%05d", strlen(data)-1);
		}
		else{
			sprintf(msg_length, "%05d", strlen(data));
			strcat(data, "\n");
		}
		strncpy(&data[5], msg_length, 5);

		print2msg(ECU_DBG_WIFI,"SendToSocketC",data);
		sprintf(sendbuff,"c00000000");
		memcpy(&sendbuff[9],data,length);
		clear_WIFI();
		
		WIFI_SendData(sendbuff, (length+9));

		free(sendbuff);
		sendbuff = NULL;

		return 0;
		
		
	}
	return -1;
}

int WIFI_ChangeSSID(char *SSID,char Auth,char Encry,char *Passwd,int passWDLen)
{
		int ret = 0,index;
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT();
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	delayMS(5);
	
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_WSSSID(SSID);
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			delayMS(5);
			ret =AT_ENTM();;
			if(ret == 0) break;
		}
	
		return -1;
	}	

	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_WSKEY(Auth,Encry,Passwd,passWDLen);
		if(ret == 0) break;
	}
	if(ret == -1)
	{
		for(index = 0;index<3;index++)
		{
			delayMS(5);
			ret =AT_ENTM();;
			if(ret == 0) break;
		}
	
		return -1;
	}	

	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_Z();
		if(ret == 0) return 0;
	}
	
	for(index = 0;index<3;index++)
	{
		delayMS(5);
		ret =AT_ENTM();
		if(ret == 0) break;
	}
	if(ret == -1) return -1;
	
	WIFI_Reset();	
	return 0;
}

int WIFI_ConStatus(void)
{
	int status = 0;
	status = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8); 
	printf("status : %d\n",status);
	return status;
}


#ifdef RT_USING_FINSH
#include <finsh.h>

FINSH_FUNCTION_EXPORT(AT , Into AT Mode.)
FINSH_FUNCTION_EXPORT(AT_ENTM , Into AT_ENTM Mode.)
FINSH_FUNCTION_EXPORT(AT_VER , Get version.)
FINSH_FUNCTION_EXPORT(AT_Z , Reset USR232.)

FINSH_FUNCTION_EXPORT(AT_WSSSID , Set WSSSID.)
FINSH_FUNCTION_EXPORT(AT_WSKEY , Set WSKEY.)

FINSH_FUNCTION_EXPORT(AT_WAP , Set WAP.)
FINSH_FUNCTION_EXPORT(AT_WAKEY , Set WAKEY.)
FINSH_FUNCTION_EXPORT(AT_WAKEY_Clear , Clear WAKEY.)

FINSH_FUNCTION_EXPORT(AT_TCPB_ON , Set TCP B ON.)
FINSH_FUNCTION_EXPORT(AT_TCPADDB , Set TCP B ADDR.)
FINSH_FUNCTION_EXPORT(AT_TCPPTB , Set TCP B PORT.)
FINSH_FUNCTION_EXPORT(AT_TCPC_ON , Set TCP C ON.)
FINSH_FUNCTION_EXPORT(AT_TCPADDC , Set TCP C ADDR.)
FINSH_FUNCTION_EXPORT(AT_TCPPTC , Set TCP C PORT.)

FINSH_FUNCTION_EXPORT(AT_FAPSTA_ON , Set FAPSTA ON.)
FINSH_FUNCTION_EXPORT(AT_WMODE , Set WMode AP or STA.)



FINSH_FUNCTION_EXPORT(InitWorkMode , Init Work Mode.)
FINSH_FUNCTION_EXPORT(InitTestMode , Init Test Mode.)

FINSH_FUNCTION_EXPORT(WIFI_Factory , Set WIFI ID .)

FINSH_FUNCTION_EXPORT(SendToSocketB , Send SOCKET B.)
FINSH_FUNCTION_EXPORT(SendToSocketC , Send SOCKET C.)

#endif


